# RoofCurveHeightOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoofCurveHeightOffset Property
ParameterTypeId Class See Also
---
"Offset From Roof Base"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoofCurveHeightOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoofCurveHeightOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoofCurveHeightOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace